<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $cities = [
            [
                'name' => 'Алматы'
            ],
            [
                'name' => 'Астана'
            ],
            [
                'name' => 'Шымкент'
            ],
            [
                'name' => 'Актобе'
            ],
            [
                'name' => 'Караганда'
            ],
            [
                'name' => 'Тараз'
            ],
            [
                'name' => 'Павлодар'
            ],
            [
                'name' => 'Семей'
            ],
            [
                'name' => 'Усть-Каменогорск'
            ],
            [
                'name' => 'Кызылорда'
            ],
            [
                'name' => 'Костанай'
            ],
            [
                'name' => 'Актау'
            ],
            [
                'name' => 'Уральск'
            ],
            [
                'name' => 'Петропавловск'
            ],
            [
                'name' => 'Туркестан'
            ],
            [
                'name' => 'Кокшетау'
            ],
            [
                'name' => 'Темиртау'
            ],
            [
                'name' => 'Талдыкорган'
            ],
            [
                'name' => 'Экибастуз'
            ],
            [
                'name' => 'Рудный'
            ],
            [
                'name' => 'Жезказган'
            ],
            [
                'name' => 'Каскелен'
            ],
            [
                'name' => 'Кентау'
            ],
            [
                'name' => 'Жанаозен'
            ],
            [
                'name' => 'Балхаш'
            ],
            [
                'name' => 'Сатпаев'
            ],
            [
                'name' => 'Кульсары'
            ],
            [
                'name' => 'Талгар'
            ],
            [
                'name' => 'Сарыагаш'
            ],
            [
                'name' => 'Конаев'
            ],
            [
                'name' => 'Жаркент'
            ],
            [
                'name' => 'Арыс'
            ],
            [
                'name' => 'Аксу'
            ],
            [
                'name' => 'Косшы'
            ],
            [
                'name' => 'Степногорск'
            ],
            [
                'name' => 'Щучинск'
            ],
            [
                'name' => 'Риддер'
            ],
            [
                'name' => 'Шу'
            ],
            [
                'name' => 'Жетысай'
            ],
            [
                'name' => 'Аягоз'
            ],
            [
                'name' => 'Есик'
            ],
            [
                'name' => 'Шахтинск'
            ],
            [
                'name' => 'Аральск'
            ],
            [
                'name' => 'Аксай'
            ],
            [
                'name' => 'Алтай'
            ],
            [
                'name' => 'Житикара'
            ],
            [
                'name' => 'Кандыагаш'
            ],
            [
                'name' => 'Сарань'
            ],
            [
                'name' => 'Байконыр(Байконур)'
            ],
            [
                'name' => 'Ленгер'
            ],
            [
                'name' => 'Шардара'
            ],
            [
                'name' => 'Лисаковск'
            ],
            [
                'name' => 'Атбасар'
            ],
            [
                'name' => 'Текели'
            ],
            [
                'name' => 'Хромтау'
            ],
            [
                'name' => 'Аркалык'
            ],
            [
                'name' => 'Абай'
            ],
            [
                'name' => 'Тобыл'
            ],
            [
                'name' => 'Каратау'
            ],
            [
                'name' => 'Шалкар'
            ],
            [
                'name' => 'Жанатас'
            ],
            [
                'name' => 'Алга'
            ],
            [
                'name' => 'Ушарал'
            ],
            [
                'name' => 'Уштобе'
            ],
            [
                'name' => 'Шемонаиха'
            ],
            [
                'name' => 'Зайсан'
            ],
            [
                'name' => 'Макинск'
            ],
            [
                'name' => 'Сарканд'
            ],
            [
                'name' => 'Акколь'
            ],
            [
                'name' => 'Тайынша'
            ],
            [
                'name' => 'Эмба'
            ],
            [
                'name' => 'Ерейментау'
            ],
            [
                'name' => 'Есиль'
            ],
            [
                'name' => 'Приозёрск'
            ],
            [
                'name' => 'Курчатов'
            ],
            [
                'name' => 'Каркаралинск'
            ],
            [
                'name' => 'Форт-Шевченко'
            ],
            [
                'name' => 'Булаево'
            ],
            [
                'name' => 'Каражал'
            ],
            [
                'name' => 'Сергеевка'
            ],
            [
                'name' => 'Казалинск'
            ],
            [
                'name' => 'Серебрянск'
            ],
            [
                'name' => 'Мамлютка'
            ],
            [
                'name' => 'Державинск'
            ],
            [
                'name' => 'Шар'
            ],
            [
                'name' => 'Степняк'
            ],
            [
                'name' => 'Темир'
            ],
            [
                'name' => 'Жем(Эмба-5)'
            ],
        ];

        asort($cities);
        foreach ($cities as $city) {
            City::create($city);
        }
    }
}
